0xkelvin/veea/device/firmware/src/i2s_esp32_pdm.c
	if (!stream->data->dma_pending) {
		return;
	}

	stream->data->dma_pending = false;

	if (stream->data->mem_block == NULL) {
		LOG_DBG("TX mem_block NULL");
		dev_data->state = I2S_STATE_ERROR;
		goto tx_disable;
	}

	k_mem_slab_free(stream->data->i2s_cfg.mem_slab, stream->data->mem_block);

#if SOC_GDMA_SUPPORTED
	if (status < 0) {
#else
	if (status & I2S_LL_EVENT_TX_DSCR_ERR) {
#endif /* SOC_GDMA_SUPPORTED */
		dev_data->state = I2S_STATE_ERROR;
		LOG_DBG("TX bad status: %d", status);
		goto tx_disable;
	}

#if CONFIG_I2S_ESP32_ALLOWED_EMPTY_TX_QUEUE_DEFERRAL_TIME_MS
	if (k_msgq_num_used_get(&stream->data->queue) == 0) {
		k_timer_start(&dev_data->tx_deferred_transfer_timer,
			      K_MSEC(CONFIG_I2S_ESP32_ALLOWED_EMPTY_TX_QUEUE_DEFERRAL_TIME_MS),
			      K_NO_WAIT);
	} else {
#else
	{
#endif
		i2s_esp32_tx_compl_transfer(&dev_data->tx_deferred_transfer_timer);
	}

	return;

tx_disable:
	i2s_esp32_tx_stop_transfer(dev);
}

#if !SOC_GDMA_SUPPORTED

static void IRAM_ATTR i2s_esp32_tx_handler(void *arg)
{
	if (arg == NULL) {
		return;
	}

	struct device *dev = (struct device *)arg;
	const struct i2s_esp32_cfg *const dev_cfg = dev->config;
	const i2s_hal_context_t *hal = &(dev_cfg->hal);
	uint32_t status = i2s_hal_get_intr_status(hal);

	i2s_hal_clear_intr_status(hal, status);
	if (status & I2S_LL_EVENT_TX_EOF) {
		i2s_esp32_tx_callback((void *)arg, status);
	}
}

#endif /* !SOC_GDMA_SUPPORTED */

static int i2s_esp32_tx_start_transfer(const struct device *dev)
{
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream = &dev_cfg->tx;
	const i2s_hal_context_t *hal = &dev_cfg->hal;
	struct queue_item item;
	int err;

	err = k_msgq_get(&stream->data->queue, &item, K_NO_WAIT);
	if (err < 0) {
		return -ENOMEM;
	}

	stream->data->mem_block = item.buffer;
	stream->data->mem_block_len = item.size;

	i2s_hal_tx_stop(hal);
	i2s_hal_tx_reset(hal);
#if !SOC_GDMA_SUPPORTED
	i2s_hal_tx_reset_dma(hal);
#endif /* !SOC_GDMA_SUPPORTED */
	i2s_hal_tx_reset_fifo(hal);

	err = i2s_esp32_start_dma(dev, I2S_DIR_TX);
	if (err < 0) {
		LOG_DBG("Failed to start TX DMA transfer: %d", err);
		return -EIO;
	}

	i2s_hal_tx_start(hal);

#if !SOC_GDMA_SUPPORTED
	esp_intr_enable(stream->data->irq_handle);
#endif /* !SOC_GDMA_SUPPORTED */

	stream->data->transferring = true;

	return 0;
}

static void i2s_esp32_tx_stop_transfer(const struct device *dev)
{
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream = &dev_cfg->tx;

#if SOC_GDMA_SUPPORTED
	dma_stop(stream->conf->dma_dev, stream->conf->dma_channel);
#else
	const i2s_hal_context_t *hal = &(dev_cfg->hal);

	esp_intr_disable(stream->data->irq_handle);
	i2s_hal_tx_stop_link(hal);
	i2s_hal_tx_disable_intr(hal);
	i2s_hal_tx_disable_dma(hal);
	i2s_hal_clear_intr_status(hal, I2S_INTR_MAX);
#endif /* SOC_GDMA_SUPPORTED */

	stream->data->mem_block = NULL;
	stream->data->mem_block_len = 0;

	stream->data->transferring = false;
}

#endif /* I2S_ESP32_IS_DIR_EN(tx) */

static int i2s_esp32_start_transfer(const struct device *dev, enum i2s_dir dir)
{
	int err = 0;

#if I2S_ESP32_IS_DIR_EN(rx)
	if (dir == I2S_DIR_RX || dir == I2S_DIR_BOTH) {
		err = i2s_esp32_rx_start_transfer(dev);
		if (err < 0) {
			LOG_DBG("RX failed to start transfer");
			goto start_transfer_end;
		}
	}
#endif /* I2S_ESP32_IS_DIR_EN(rx) */

#if I2S_ESP32_IS_DIR_EN(tx)
	if (dir == I2S_DIR_TX || dir == I2S_DIR_BOTH) {
		err = i2s_esp32_tx_start_transfer(dev);
		if (err < 0) {
			LOG_DBG("TX failed to start transfer");
			goto start_transfer_end;
		}
	}
#endif /* I2S_ESP32_IS_DIR_EN(tx) */

start_transfer_end:
#if I2S_ESP32_IS_DIR_EN(rx) && I2S_ESP32_IS_DIR_EN(tx)
	if (dir == I2S_DIR_BOTH && err < 0) {
		const struct i2s_esp32_cfg *dev_cfg = dev->config;

		if (dev_cfg->rx.data->transferring && !dev_cfg->tx.data->transferring) {
			i2s_esp32_rx_stop_transfer(dev);
		}

		if (!dev_cfg->rx.data->transferring && dev_cfg->tx.data->transferring) {
			i2s_esp32_tx_stop_transfer(dev);
		}
	}
#endif /* I2S_ESP32_IS_DIR_EN(rx) && I2S_ESP32_IS_DIR_EN(tx) */

	return err;
}

static void i2s_esp32_stop_transfer(const struct device *dev, enum i2s_dir dir)
{
#if I2S_ESP32_IS_DIR_EN(rx)
	if (dir == I2S_DIR_RX || dir == I2S_DIR_BOTH) {
		i2s_esp32_rx_stop_transfer(dev);
	}
#endif /* I2S_ESP32_IS_DIR_EN(rx) */

#if I2S_ESP32_IS_DIR_EN(tx)
	if (dir == I2S_DIR_TX || dir == I2S_DIR_BOTH) {
		i2s_esp32_tx_stop_transfer(dev);
	}
#endif /* I2S_ESP32_IS_DIR_EN(tx) */
}

static bool i2s_esp32_try_stop_transfer(const struct device *dev, enum i2s_dir dir,
					enum i2s_trigger_cmd cmd)
{
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream;
	bool at_least_one_dir_with_pending_transfer = false;

#if I2S_ESP32_IS_DIR_EN(rx)
	if (dir == I2S_DIR_RX || dir == I2S_DIR_BOTH) {
		stream = &dev_cfg->rx;
		if (stream->data->dma_pending) {
			at_least_one_dir_with_pending_transfer = true;
		} else {
			i2s_esp32_rx_stop_transfer(dev);
		}
	}
#endif /* I2S_ESP32_IS_DIR_EN(rx) */

#if I2S_ESP32_IS_DIR_EN(tx)
	if (dir == I2S_DIR_TX || dir == I2S_DIR_BOTH) {
		stream = &dev_cfg->tx;
		if ((cmd == I2S_TRIGGER_DRAIN && k_msgq_num_used_get(&stream->data->queue) > 0) ||
		    stream->data->dma_pending) {
			at_least_one_dir_with_pending_transfer = true;
		} else {
			i2s_esp32_tx_stop_transfer(dev);
		}
	}
#endif /* I2S_ESP32_IS_DIR_EN(tx) */

	return at_least_one_dir_with_pending_transfer;
}

int i2s_esp32_config_dma(const struct device *dev, enum i2s_dir dir,
			 const struct i2s_esp32_stream *stream)
{
	uint32_t mem_block = (uint32_t)stream->data->mem_block;
	uint32_t mem_block_size = stream->data->mem_block_len;

#if SOC_GDMA_SUPPORTED
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	struct dma_config dma_cfg = {0};
	struct dma_block_config dma_blk = {0};
	int err;

	dma_blk.block_size = mem_block_size;
	if (dir == I2S_DIR_RX) {
#if I2S_ESP32_IS_DIR_EN(rx)
		dma_blk.dest_address = mem_block;
		dma_cfg.channel_direction = PERIPHERAL_TO_MEMORY;
		dma_cfg.dma_callback = i2s_esp32_rx_callback;
#endif /* I2S_ESP32_IS_DIR_EN(rx) */
	} else {
#if I2S_ESP32_IS_DIR_EN(tx)
		dma_blk.source_address = mem_block;
		dma_cfg.channel_direction = MEMORY_TO_PERIPHERAL;
		dma_cfg.dma_callback = i2s_esp32_tx_callback;
#endif /* I2S_ESP32_IS_DIR_EN(tx) */
	}
	dma_cfg.user_data = (void *)dev;
	dma_cfg.dma_slot =
		dev_cfg->unit == 0 ? ESP_GDMA_TRIG_PERIPH_I2S0 : ESP_GDMA_TRIG_PERIPH_I2S1;
	dma_cfg.block_count = 1;
	dma_cfg.head_block = &dma_blk;

