0xkelvin/veea/device/firmware/src/i2s_esp32_pdm.c
	return 0;
}

static int i2s_esp32_initialize(const struct device *dev)
{
	struct i2s_esp32_data *dev_data = dev->data;
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	const struct device *clk_dev = dev_cfg->clock_dev;
	const struct i2s_esp32_stream *stream;
	int err;

#if !SOC_GDMA_SUPPORTED
	const i2s_hal_context_t *hal = &(dev_cfg->hal);
#endif /* !SOC_GDMA_SUPPORTED */

	if (!device_is_ready(clk_dev)) {
		LOG_DBG("Clock control device not ready");
		return -ENODEV;
	}

	err = clock_control_on(clk_dev, dev_cfg->clock_subsys);
	if (err != 0) {
		LOG_DBG("Clock control enabling failed: %d", err);
		return -EIO;
	}

	err = pinctrl_apply_state(dev_cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (err < 0) {
		LOG_DBG("Pins setup failed: %d", err);
		return -EIO;
	}

#if I2S_ESP32_IS_DIR_EN(rx)
	if (dev_cfg->rx.data && dev_cfg->rx.conf) {
		stream = &dev_cfg->rx;
#if SOC_GDMA_SUPPORTED
		if (stream->conf->dma_dev && !device_is_ready(stream->conf->dma_dev)) {
			LOG_DBG("%s device not ready", stream->conf->dma_dev->name);
			return -ENODEV;
		}
#else
		int irq_flags = ESP_PRIO_TO_FLAGS(stream->conf->irq_priority) |
				ESP_INT_FLAGS_CHECK(stream->conf->irq_flags) |
				ESP_INTR_FLAG_IRAM | ESP_INTR_FLAG_INTRDISABLED |
				ESP_INTR_FLAG_SHARED;

		err = esp_intr_alloc_intrstatus(stream->conf->irq_source, irq_flags,
						(uint32_t)i2s_ll_get_intr_status_reg(hal->dev),
						I2S_LL_RX_EVENT_MASK, i2s_esp32_rx_handler,
						(void *)dev, &(stream->data->irq_handle));
		if (err != 0) {
			LOG_DBG("Could not allocate rx interrupt (err %d)", err);
			return err;
		}
#endif /* SOC_GDMA_SUPPORTED */

		err = k_msgq_alloc_init(&stream->data->queue, sizeof(struct queue_item),
					CONFIG_I2S_ESP32_RX_BLOCK_COUNT);
		if (err < 0) {
			return err;
		}
	}
#endif /* I2S_ESP32_IS_DIR_EN(rx) */

#if I2S_ESP32_IS_DIR_EN(tx)
	dev_data->dev = dev;
	k_timer_init(&dev_data->tx_deferred_transfer_timer, i2s_esp32_tx_compl_transfer, NULL);

	if (dev_cfg->tx.data && dev_cfg->tx.conf) {
		stream = &dev_cfg->tx;
#if SOC_GDMA_SUPPORTED
		if (stream->conf->dma_dev && !device_is_ready(stream->conf->dma_dev)) {
			LOG_DBG("%s device not ready", stream->conf->dma_dev->name);
			return -ENODEV;
		}
#else
		int irq_flags = ESP_PRIO_TO_FLAGS(stream->conf->irq_priority) |
				ESP_INT_FLAGS_CHECK(stream->conf->irq_flags) |
				ESP_INTR_FLAG_IRAM | ESP_INTR_FLAG_INTRDISABLED |
				ESP_INTR_FLAG_SHARED;

		err = esp_intr_alloc_intrstatus(stream->conf->irq_source, irq_flags,
						(uint32_t)i2s_ll_get_intr_status_reg(hal->dev),
						I2S_LL_TX_EVENT_MASK, i2s_esp32_tx_handler,
						(void *)dev, &(stream->data->irq_handle));
		if (err != 0) {
			LOG_DBG("Could not allocate tx interrupt (err %d)", err);
			return err;
		}
#endif /* SOC_GDMA_SUPPORTED */

		err = k_msgq_alloc_init(&stream->data->queue, sizeof(struct queue_item),
					CONFIG_I2S_ESP32_TX_BLOCK_COUNT);
		if (err < 0) {
			return err;
		}
	}
#endif /* I2S_ESP32_IS_DIR_EN(tx) */

#if !SOC_GDMA_SUPPORTED
	i2s_ll_clear_intr_status(hal->dev, I2S_INTR_MAX);
#endif /* !SOC_GDMA_SUPPORTED */

	dev_data->state = I2S_STATE_NOT_READY;

	LOG_DBG("%s initialized", dev->name);

	return 0;
}

static int i2s_esp32_config_check(const struct device *dev, enum i2s_dir dir,
				  const struct i2s_config *i2s_cfg)
{
	struct i2s_esp32_data *dev_data = dev->data;
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream;
	uint8_t data_format;

	if (dir == I2S_DIR_BOTH &&
	    (!dev_cfg->rx.conf || !dev_cfg->rx.data || !dev_cfg->tx.conf || !dev_cfg->tx.data)) {
		LOG_DBG("I2S_DIR_BOTH not supported");
		return -ENOSYS;
	}

	if (dev_data->state != I2S_STATE_NOT_READY && dev_data->state != I2S_STATE_READY) {
		LOG_DBG("Invalid state: %d", (int)dev_data->state);
		return -EINVAL;
	}

	if (dir == I2S_DIR_RX || dir == I2S_DIR_BOTH) {
#if I2S_ESP32_IS_DIR_EN(rx)
		stream = &dev_cfg->rx;
		if (!stream->data || !stream->conf) {
			LOG_DBG("RX not enabled");
			return -EINVAL;
		}

#if SOC_GDMA_SUPPORTED
		if (stream->conf->dma_dev == NULL) {
			LOG_DBG("RX DMA controller not available");
#else
		if (stream->conf->irq_source == -1) {
			LOG_DBG("RX IRQ source not available");
#endif /* SOC_GDMA_SUPPORTED */
			return -EINVAL;
		}
#else
		LOG_DBG("RX not enabled");
		return -EINVAL;
#endif /* I2S_ESP32_IS_DIR_EN(rx) */
	}

	if (dir == I2S_DIR_TX || dir == I2S_DIR_BOTH) {
#if I2S_ESP32_IS_DIR_EN(tx)
		stream = &dev_cfg->tx;
		if (!stream->data || !stream->conf) {
			LOG_DBG("TX not enabled");
			return -EINVAL;
		}

#if SOC_GDMA_SUPPORTED
		if (stream->conf->dma_dev == NULL) {
			LOG_DBG("TX DMA controller not available");
#else
		if (stream->conf->irq_source == -1) {
			LOG_DBG("TX IRQ source not available");
#endif /* SOC_GDMA_SUPPORTED */
			return -EINVAL;
		}
#else
		LOG_DBG("TX not enabled");
		return -EINVAL;
#endif /* I2S_ESP32_IS_DIR_EN(tx) */
	}

	if (i2s_cfg->frame_clk_freq == 0U) {
		return 0;
	}

	if (i2s_cfg->mem_slab == NULL) {
		LOG_DBG("Memory slab is NULL");
		return -EINVAL;
	}

	if (i2s_cfg->block_size == 0) {
		LOG_DBG("Block size is 0");
		return -EINVAL;
	}

	data_format = i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK;

	if (data_format != I2S_FMT_DATA_FORMAT_I2S &&
	    data_format != I2S_FMT_DATA_FORMAT_LEFT_JUSTIFIED &&
	    data_format != I2S_FMT_DATA_FORMAT_RIGHT_JUSTIFIED) {
		LOG_DBG("Invalid data format: %u", (unsigned int)data_format);
		return -EINVAL;
	}

	if (data_format == I2S_FMT_DATA_FORMAT_I2S && i2s_cfg->format & I2S_FMT_DATA_ORDER_LSB) {
		LOG_DBG("Invalid format: %u", (unsigned int)i2s_cfg->format);
		return -EINVAL;
	}

	if (i2s_cfg->word_size != 8 && i2s_cfg->word_size != 16 && i2s_cfg->word_size != 24 &&
	    i2s_cfg->word_size != 32) {
		LOG_DBG("Word size not supported: %d", (int)i2s_cfg->word_size);
		return -EINVAL;
	}

	if (i2s_cfg->channels != 2) {
		LOG_DBG("Currently only 2 channels are supported");
		return -EINVAL;
	}

	if (i2s_cfg->options & I2S_OPT_LOOPBACK) {
		LOG_DBG("Unsupported option: I2S_OPT_LOOPBACK");
		LOG_DBG("To enable loopback, use the same SD for TX and RX pinctrl");
		return -EINVAL;
	}

	if (i2s_cfg->options & I2S_OPT_PINGPONG) {
		LOG_DBG("Unsupported option: I2S_OPT_PINGPONG");
		return -EINVAL;
	}

